{
	"check": "Check",
	"alert": "CMH Alert",
	"onGoingCheck": "Checking your connection ...",
	"pleaseWait": "Please wait ...",
	"notURL": "It is not a URL.",
	"noHttps": "It is not a HTTPS website (check the URL).",
	"defaultURL": "Default URL",
	"secureConnection": "Your HTTPS connection is secure.",
	"danger": "Your connection might be listened to...",
	"SSLPeerUnverified": "The requested domain name does not match the server’s certificate.",
	"serverUnreachable": "Server unreachable...",
	"serverUnknown": "Server unknown...",
	"privateIp": "We couldn't reach this IP from our check server (this is a private IP).",
	"severalCertificates": "This website has several server certificates. We can not guarantee that your HTTPS connection is secure.",
	"whitelisted": "Your HTTPS connection is secure (Whitelisted Domain).",
	"sslPinning": "The requested check server is different. Your connection might be listened to...",
	"checkServerSettings": "Check Server Settings",
	"checkServerAddress": "Check Server Address",
	"checkServerSha256": "Check Server SHA256",
	"save": "Save",
	"restoreDefault": "Default",
	"newCheckServer": "The new check server has been set.",
	"newDefaultURL" : "The new URL has been set.",
	"getFingerprints": "Get fingerprints",
	"alertOnUnicodeIDNDomainNames": "The domain name is an international one and your browser shows it in Unicode",
	"menu":"Menu",
	"home": "Home",
	"about": "About",
	"how": "How does the app work",
	"settings": "Settings",
	"titleAbout": "Check if your encrypted WEB traffic (HTTPS) is being intercepted",
	"descriptionAbout": "This mobile app allows you to check if your encrypted web traffic (SSL/TLS) towards secure Internet servers (HTTPS) is being intercepted.",
	"ideaAbout": "Original idea & Supervision",
	"design_dev_About1": "Design and development of the CheckMyHTTPS project",
	"design_dev_About2": "Design and development of the mobile app",
	"titleHow": "Explanation",
	"HowText1": "Normally, a secure website has to prove its identity to your browser by sending a certificate validated by a recognized certificate authority.",
	"HowText2": "Interception techniques generate dynamically forged certificates in order to fool the user into believing that his connection is secure.",
	"HowText3": "This mobile app checks that the received certificate is the right one.",
	"HowText4": "This app will compare that the certificate received by the client (1) from a visited HTTPS website matches the certificate seen by a remote check server* (2), ensuring that no interception is taking place.",
	"HowText5": "If they are different, your connection might be listened to! This allows us to prove the interception.",
	"HowText6": "Here is how CheckMyHTTPS works :",
	"legendImage": "Here is what happens when CheckMyHTTPS checks your HTTPS connection (https://facebook.com)",
	"ownServer": "* this server is by default « checkmyhttps.net ». You can install your own server (see documentation on the CheckMyHTTPS' GitHub).",
	"skip": "Skip",
	"creditsIcons": "Icons made by Daniel Bruce and Freepik from www.flaticon.com",
	"TitreIntro1": "Introduction",
	"Intro1": "This app checks if your connection is secure when you provide the URL of a website",
	"TitreIntro2": "Share",
	"Intro2": "You can also launch the app from your web browser (Chrome, Firefox) by clicking on Share...",
	"TitreIntro3": "The Server Parameters",
	"Intro3": "If you want to change the check server, please look at the documentation in the CheckMyHTTPS' GitHub",
	"continue":"Continue",
	"Theme":"Theme",
	"titleLightTheme":"Light Theme",
	"titleDarkTheme":"Dark Theme",
	"darkTheme1":"Dark theme turns the light surfaces of the page dark.",
	"titleDefaultURL": "Change the default URL",
	"version": "Version",
	"versionApp": "Version of the app",
	"checkURL": "URL of a HTTPS site"
}
