{
	"check": "Vérifier",
	"alert": "Alerte de CMH",
	"onGoingCheck": "Vérification en cours ...",
	"pleaseWait": "Veuillez patienter s'il vous plaît ...",
	"notURL": "Ce n'est pas un URL.",
	"noHttps": "Ce n'est pas un site HTTPS (vérifiez l'URL).",
	"defaultURL": "URL par défaut",
	"secureConnection": "Votre connexion HTTPS est sécurisée.",
	"danger": "Votre connexion est peut-être sur-écoute ...",
	"SSLPeerUnverified": "Le nom du domaine n'est pas le même que sur le certificat",
	"serverUnreachable": "Serveur injoignable ...",
	"privateIp": "Nous ne pouvons pas joindre cette IP via notre serveur de test (IP privée).",
	"severalCertificates": "Ce site possède plusieurs certificats de sécurité. Le contrôle de conformité du flux HTTPS ne peut donc pas être assuré.",
	"whitelisted": "Votre connexion HTTPS est sécurisée (Whitelisted Domain).",
	"sslPinning": "Le serveur de vérification requêté est différent. Votre connexion est peut-être sur-écoute ...",
	"checkServerSettings": "Paramétrage du serveur de vérification",
	"checkServerAddress": "Adresse du serveur",
	"checkServerSha256": "SHA256 du serveur",
	"save": "Sauvegarder",
	"restoreDefault": "Défaut",
	"newCheckServer": "Le nouveau serveur de vérification a été enregistré",
	"newDefaultURL" : "Le nouveau URL a été enregistré",
	"getFingerprints": "Récupérer les empreintes",
	"alertOnUnicodeIDNDomainNames": "Le nom de domaine est internationalisé et votre navigateur l'affiche en Unicode",
	"menu":"Menu",
	"home": "Accueil",
	"about": "À Propos",
	"how": "Explication",
	"settings": "Paramètres",
	"titleAbout": "Vérifiez que vos flux WEB sécurisés (HTTPS) ne sont pas interceptés",
	"descriptionAbout": "Cette application mobile vérifie que vos connexions web sécurisées (protocole HTTPS) ne sont pas interceptées (ni déchiffrées, ni écoutées, ni modifiées).",
	"ideaAbout": "Idée originale et gestion de projet",
	"design_dev_About1": "Design et développement du projet CheckMyHTTPS",
	"design_dev_About2": "Design et développement de l'application mobile",
	"titleHow": "Fonctionnement de l'application",
	"HowText1": "Normalement, un site web sécurisé justifie son identité auprès de votre navigateur par l’envoi d’un certificat de sécurité de type « serveur » validé par une autorité de certification reconnue.",
	"HowText2": "Les techniques d'interception, pour pouvoir fonctionner, génèrent dynamiquement de faux certificats de type « serveur » (un peu comme une fausse carte d'identité).",
	"HowText3": "Cette application mobile permet de vérifier que le certificat reçu est bien celui qui a été envoyé.",
	"HowText4":"Elle va comparer le certificat vu par le client (1) avec celui vu par le serveur externe de vérification* (2).",
	"HowText5": "S'ils diffèrent, votre connexion est sur-écoute (cadenas rouge). Cela est suffisant pour prouver l'interception.",
	"HowText6": "Voici un schéma simplifié permettant de comprendre le test effectué par l'application mobile :",
	"legendImage": "Voici ce que fait CheckMyHTTPS si vous effectuez un test sur un site HTTPS (https://facebook.com)",
	"ownServer": "*ce serveur est par défaut « checkmyhttps.net ». Vous pouvez installer votre propre serveur (cf. documentation sur le GitHub).",
	"skip": "Passer",
	"creditsIcons": "Icônes réalisés par Daniel Bruce et Freepik sur www.flaticon.com",
	"TitreIntro1": "Présentation",
	"Intro1": "Cette application vérifie que votre connexion est sécurisée si vous rentrez le lien (URL) d'un site web",
	"TitreIntro2": "Partager",
	"Intro2": "Vous pouvez également lancer l'application depuis votre navigateur (Chrome, Firefox) en cliquant sur Partager...",
	"TitreIntro3": "Paramètres du serveur",
	"Intro3": "Si vous souhaitez changer le serveur de vérification, veuillez regarder la documentation disponible sur le GitHub de CheckMyHTTPS",
	"continue":"Continuer",
	"Theme":"Thème",
	"titleLightTheme": "Thème clair",
	"titleDarkTheme": "Thème foncé",
	"darkTheme1":"Le thème foncé permet d'assombrir les surfaces claires de la page.",
	"titleDefaultURL": "Modifier l'URL par défaut",
	"version": "Version",
	"versionApp": "Version de l'application",
	"checkURL": "URL d’un site HTTPS"
}
