Repository: checkmyhttps/checkmyhttps
Catalog: Mobile_App/lib/l10n/app_*.arb
Languages: fr

# noInternet
source: No internet connection!
fr: Pas de connexion Internet!

source: Light Theme
fr: Thème Clair

source: Dark Theme
fr: Thème Sombre

source: Home
fr: Accueil

source: How
fr: Comment

source: About
fr: À propos

source: Settings
fr: Paramètres

source: Switch Theme
fr: Changer le Theme

source: Language
fr: Langue

source: Change Language
fr: Changer la langue

source: Default URL
fr: URL par défaut

source: Check Server
fr: Serveur de vérification

source: Check Server Address
fr: Adresse du serveur de vérification

# checkServerHash
source: Check Server SHA256
fr: Sha256 du serveur de vérification

source: Check Server Public Key
fr: Clé publique du serveur de vérification

source: Get Fingerprints
fr: Obtenir des empreintes digitales

source: Get Public Key
fr: Obtenir la clé publique

source: Reset Default
fr: Réinitialiser par défaut

source: Website URL
fr: URL de site web

source: Check
fr: Vérifier

# titleAbout
source: Check if your encrypted WEB traffic (HTTPS) is being intercepted
fr: Vérifiez si votre trafic Web chiffré (HTTPS) est en cours d'interception

# descriptionAbout
source: This mobile app allows you to check if your encrypted web traffic (SSL/TLS) towards secure Internet servers (HTTPS) is being intercepted.
fr: Cette application mobile vous permet de vérifier si votre trafic Web chiffré (SSL / TLS) vers des serveurs Internet sécurisés (HTTPS) est en cours d'interception.

# versionApp
source: Version of the app
fr: Version de l'application

# originalIdea
source: Original idea & Supervision
fr: Idée originale et supervision

# designDevProject
source: Design and development of the CheckMyHTTPS project
fr: Conception et développement du projet CheckMyHTTPS

# designDevApp
source: Design and development of the mobile app
fr: Conception et développement de l'application mobile

source: Explanation
fr: Explication

# howText
source: Normally, a secure website has to prove its identity to your browser by sending a certificate validated by a recognized certificate authority. Interception techniques generate dynamically forged certificates in order to fool the user into believing that his connection is secure. This mobile app checks that the received certificate is the right one. This app will compare that the certificate received by the client (1) from a visited HTTPS website matches the certificate seen by a remote check server* (2), ensuring that no interception is taking place. If they are different, your connection might be listened to! This allows us to prove the interception.
fr: Normalement, un site Web sécurisé doit prouver son identité à votre navigateur en envoyant un certificat validé par une autorité de certificat reconnue. Les techniques d'interception génèrent des certificats forgés dynamiquement pour tromper l'utilisateur et le faire croire que sa connexion est sécurisée. Cette application mobile vérifie que le certificat reçu est le bon. Elle compare le certificat reçu par le client (1) lors de la visite d'un site Web HTTPS avec le certificat vu par un serveur de contrôle distant (2), garantissant ainsi qu'aucune interception n'a lieu. Si ces certificats sont différents, votre connexion pourrait être écoutée ! Cela nous permet de prouver l'interception.

# defaultServer
source: This server is by default « {defaultServerAddress} ». You can install your own server (see documentation on the CheckMyHTTPS' GitHub).
fr: Ce serveur est par défaut « {defaultServerAddress} ». Vous pouvez installer votre propre serveur (voir la documentation sur CheckMyHTTPS GitHub).

# howImageTitle
source: Here is how CheckMyHTTPS works :
fr: Voici comment fonctionne CheckMyHTTPS:

# howImageLegend
source: Here is what happens when CheckMyHTTPS checks your HTTPS connection
fr: Voici ce qui se passe lorsque CheckMyHTTPS vérifie votre connexion HTTPS

source: Next
fr: Suivant

source: Previous
fr: Précédent

source: Close
fr: Fermer

# intro1
source: This app checks if your connection is secure when you provide the URL of a website
fr: Cette application vérifie si votre connexion est sécurisée lorsque vous fournissez l'URL d'un site Web

# introTitle2
source: Share
fr: Partager

# intro2
source: You can also launch the app from your web browser (Chrome, Firefox) by clicking on Share...
fr: Vous pouvez également lancer l'application à partir de votre navigateur Web (Chrome, Firefox) en cliquant sur Partager ...

# introTitle3
source: The Server Parameters
fr: Les paramètres du serveur

# intro3
source: If you want to change the check server, please look at the documentation in the CheckMyHTTPS' GitHub
fr: Si vous souhaitez modifier le serveur de vérification, veuillez consulter la documentation dans le GitHub de CheckMyHTTPS

# noHttps
source: It is not a HTTPS website (check the URL)
fr: Ce n'est pas un site HTTPS (vérifiez l'URL)

source: Server unreachable...
fr: Serveur injoignable...

# danger
source: Your connection might be listened to...
fr: Votre connexion est peut-être sur-écoute...

# alertOnUnicodeIdnDomainNames
source: The domain name is an international one and your browser shows it in Unicode
fr: Le nom de domaine est internationalisé et votre navigateur l'affiche en Unicode

# sslPeerUnverified
source: The requested domain name does not match the server's certificate.
fr: Le nom du domaine n'est pas le même que sur le certificat.

# platformNotSupported
source: Browser-based apps not supported
fr: Applications basées sur le navigateur non prises en charge

# newCheckServer
source: The new check server has been set.
fr: Le nouveau serveur de vérification a été enregistré

# privateIp
source: We couldn't reach this IP from our check server (this is a private IP).
fr: Nous ne pouvons pas joindre cette IP via notre serveur de vérification (IP privée).

source: Server unknown...
fr: Serveur inconnu ...

# sslPinning
source: The requested check server is different. Your connection might be listened to...
fr: Le serveur de vérification requêté est différent. Votre connexion est peut-être sur-écoute ...

# secureConnection
source: Your HTTPS connection is secure.
fr: Votre connexion HTTPS est sécurisée.

# notURL
source: It is not a URL.
fr: Ce n'est pas un URL.

source: Save
fr: Sauvegarder
